# Energy Analysis Surface Tilt Property

Source: https://www.revitapidocs.com/2026/428deb34-4f14-48aa-9c40-040158ec644e.htm

---

| Energy Analysis Surface Tilt Property |
| --- |

The tilt angle for this surface, in radians.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double Tilt { get; }
```

```
Public ReadOnly Property Tilt As Double
	Get
```

```
public:
property double Tilt {
	double get ();
}
```

```
member Tilt : float with get
```

#### Property Value

Double Remarks The tilt is computed as the angle of rotation between
 the outward normal of the surface and the Z\-axis. See Also

#### Reference

EnergyAnalysisSurface Class Autodesk.Revit.DB.Analysis Namespace